In [1]:
import pandas as pd

# Series

* index - value

# Dataframe

* index-column-value

In [2]:
s1 = pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
s1.sum()

100

In [4]:
s1.mean()

25.0

In [7]:
s2 = pd.Series(['분식이', '쏘니', '홍길동', '변사또'],index=['하나', '둘', '셋', '넷'], name='출석부')
s2
#dtype: object인 이유는 Series안의 value값이 문자열이기 때문이다.
# index 뒤에 name='abc' 하면 Series의 이름을 생성할 수 있음.

하나    분식이
둘      쏘니
셋     홍길동
넷     변사또
Name: 출석부, dtype: object

In [8]:
s3 = pd.Series({'name': '김분식', 'age': 30, 'gender':'남성', 'job': '분석가'})
s3

name      김분식
age        30
gender     남성
job       분석가
dtype: object

In [9]:
s4 = pd.Series(['국어', '수학', '사회', '과학'])
s4

0    국어
1    수학
2    사회
3    과학
dtype: object

In [10]:
s4[0]

'국어'

In [11]:
s3['name']

'김분식'

In [12]:
s4[:]

0    국어
1    수학
2    사회
3    과학
dtype: object

In [15]:
s4[:2]

0    국어
1    수학
dtype: object

In [14]:
s3

name      김분식
age        30
gender     남성
job       분석가
dtype: object

In [17]:
s3 == '분석가'
# s3내에서 분석가라고 있는 데이터를 찾아서 True로 반환

name      False
age       False
gender    False
job        True
dtype: bool

In [19]:
s3[ s3=='분석가']
# s3에 있는 분석가가 있는 데이터만 추출해서 가져옴

job    분석가
dtype: object

# Dataframe

In [21]:
pd.DataFrame([10,20,30,40,50])
# Dataframe은 Column까지 추가가 됨

    0
0  10
1  20
2  30
3  40
4  50

In [22]:
pd.DataFrame([[10,20,30,40],['철수', '영희','분식','은희']])

    0   1   2   3
0  10  20  30  40
1  철수  영희  분식  은희

In [26]:
df1 = pd.DataFrame([[1000, '과자', '2019-12-31', '반품'],
                   [2000, '음료', '2020-03-02', '정상'],
                   [3000, '아이스크림', '2020-02-03', '정상'],
                   [1000, '과자', '2019-12-31', '반품']],
                  columns=['가격','종류','판매일자','반품여부'])
df1

     가격     종류        판매일자 반품여부
0  1000     과자  2019-12-31   반품
1  2000     음료  2020-03-02   정상
2  3000  아이스크림  2020-02-03   정상
3  1000     과자  2019-12-31   반품

In [27]:
df1['가격']
#df1의 가격 Column만 가져와서 Series 형태로 보여줌, dtype= int64면 숫자

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [29]:
df1['종류']
# dtype이 object면 문자열

0       과자
1       음료
2    아이스크림
3       과자
Name: 종류, dtype: object

In [30]:
df1['가격'].sum()

7000

In [31]:
df1['가격'].mean()

1750.0

In [37]:
# Series 형태로 값을 나타냄
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [36]:
# DataFrame형태로 값을 나타냄
df1[['가격']]

     가격
0  1000
1  2000
2  3000
3  1000

In [38]:
df1

     가격     종류        판매일자 반품여부
0  1000     과자  2019-12-31   반품
1  2000     음료  2020-03-02   정상
2  3000  아이스크림  2020-02-03   정상
3  1000     과자  2019-12-31   반품

In [39]:
df1[['가격','종류']]
# 여러개의 Columns를 가져오려면 무조건 대괄호를 2번 쳐야함!!

     가격     종류
0  1000     과자
1  2000     음료
2  3000  아이스크림
3  1000     과자